import styles from "./privacy-policy.module.css";

const PrivacyPolicyPage = () => {
  return (
    <div className={styles.privacyPolicy} data-testid="privacyPolicy">
      <h1 className={styles.privacyPolicy__title}>Политика конфиденциальности</h1>
      <h2 className={styles.privacyPolicy__title}>Memorush</h2>
      <div className={styles.privacyPolicy__content}>
        <div className={styles.section}>
          <h2 className={styles.section__title}>Определение понятий</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}><p>
              "<strong>Закон</strong>" означает Федеральный закон Российской Федерации
              "О персональных данных" со всеми изменениями и дополнениями, а также
              иные законодательные акты Российской Федерации.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Мобильное приложение</strong>" это программное обеспечение (со
              всеми существующими дополнениями и улучшениями), предназначенное для
              работы на смартфонах, планшетах, часах и других мобильных устройствах, и
              разработанное для конкретной платформы (iOS, Android, Windows Phone и т.
              д.).
            </p></li>
            <li className={styles.infoBlock__item}><p>
              Для целей настоящей Политики под Мобильным приложением
              подразумевается следующее программное обеспечение:
              <span id="span_id_название_приложения">Memorush</span>.
            </p></li>
            <li className={styles.infoBlock__item}><p>"<strong>Веб-приложение</strong>" — клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера. Логика веб-приложения распределена между сервером и клиентом, хранение данных осуществляется, преимущественно, на сервере, обмен информацией происходит по сети.</p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Персональные данные</strong>" означает совокупность личных
              данных и/или неперсонифицированной информации о Пользователе,
              предоставляемую им самим Правообладателю и/или автоматически собираемую
              Правообладателем и/или третьими лицами.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Пользователь</strong>" означает юридическое или физическое
              лицо, которое загрузило Мобильное приложение на смартфон, планшет, часы
              или любое другое мобильное устройство и/или осуществило активацию такого
              Мобильного/Веб приложения на одном из указанных устройств.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Пользовательское соглашение</strong>" означает соглашение,
              заключаемое между Правообладателем и Пользователем в отношении порядка,
              правил и особенностей использования Пользователем Мобильного/Веб приложения.
              Пользователь присоединяется к такому соглашению и не имеет права вносить
              и/или требовать внесения в него каких-либо изменений или дополнений.
              Пользователь может ознакомиться с условиями Пользовательского соглашения
              по следующей ссылке:
              <span id="span_id_пользовательское_соглашение">
                https://memorush.ru/term-of-use
              </span>
              .
            </p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Правообладатель</strong>" означает следующее лицо, которому
              принадлежат исключительные права владения Мобильным приложением
            </p></li>
            <li className={styles.infoBlock__item}><p>
              <em>
                <span id="span_id_название_компании">
                  Дубовицкий Юрий Алексеевич, 129323, y.dubovitsky@gmail.com
                </span>
              </em>
            </p></li>
            <li className={styles.infoBlock__item}><p>
              "<strong>Файлы куки</strong>" означает небольшие файлы, отправляемые
              каким-либо мобильным приложениям или сайтом, и размещаемые на
              смартфонах, планшетах, часах и других мобильных устройствах
              Пользователя, для улучшения работы таких приложений или сайтов, а также
              качества размещенного в них контента.
            </p></li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Отношения, на которые распространяется политика</h2>
          <h3>Общие положения</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}><p>
              Данная Политика используется и применима исключительно к Персональным
              данным, получаемым от Пользователя в связи с использованием им
              Мобильного/Веб приложения.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              определение видов и типов получаемых Персональных
              данных, направлений и целей использования (обработки) Персональных
              данных, а также источников получения таких Персональных данных; и
            </p></li>
            <li className={styles.infoBlock__item}><p>
              определение прав Пользователя в отношении защиты
              конфиденциальности передаваемых им Персональных данных; и
            </p></li>
            <li className={styles.infoBlock__item}><p>
              определение лиц, ответственных за обработку и
              хранение Персональных данных, а также третьих лиц, которым такие
              данные раскрываются (полностью или частично).
            </p></li>
            <li className={styles.infoBlock__item}><p>
              Правила настоящей Политики не применяются в случае обработки третьими
              лицами Персональных данных, которые добровольно предоставляются
              Пользователем.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              Посредством установки и/или активации Мобильного/Веб приложения на
              смартфоне, планшете, часах или другом устройстве
              Пользователь соглашается с условиями данной Политики и дает свое
              согласие Правообладателю на сбор, обработку, удержание и хранение
              Персональных данных в порядке и на условиях, предусмотренных настоящей
              Политикой.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              Если Пользователь не согласен с условиями Политики и/или отдельные
              условия Политики ему не понятны, в таком случае Пользователь обязан
              немедленно прекратить использование Мобильного/Веб приложения.
            </p></li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>В связи с предоставлением Персональных данных Пользователь автоматически получает следующие права:</h2>
          <h3>Общие положения</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}><p>
              получать данные, касающиеся их обработки (основания
              и цели такой обработки, применяемые способы обработки, сведения о лицах,
              которые имеют доступ к ним или которым они могут быть раскрыты на
              основании договора или Закона).
            </p></li>
            <li className={styles.infoBlock__item}><p>
              получать данные о месте нахождения и
              идентификационных данных лиц, совершающих обработку Персональных данных.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              получать данные о сроках хранения Персональных
              данных.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              получать данные об осуществленной или о
              предполагаемой трансграничной передаче Персональных данных.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              получать информацию о месте нахождения и
              идентификационных данных лиц, совершающих хранение Персональных данных.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              обжаловать действия или бездействие Правообладателя
              в уполномоченный орган по защите прав субъектов персональных данных или
              в судебном порядке.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              получать возмещение убытков и/или компенсацию
              морального вреда в судебном порядке в следствие допущенных
              Правообладателем и/или третьими лицами нарушений прав Пользователя на
              охрану и защиту его Персональных данных.
            </p></li>
            <li className={styles.infoBlock__item}><p>
              реализовывать иные права в области защиты
              персональных данных, предусмотренные Законом или положениями данной
              Политики.
            </p></li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Перечень собираемых персональных данных</h2>
          <h3>Неперсонифицированная информация о пользователях</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}><p>
              В связи с использованием Мобильного/Веб приложения Правообладатель может
              автоматически собирать и обрабатывать следующею неперсонифицированную
              информацию о Пользователе (Данная неперсонифицированная информация о Пользователе не является персональными данными, так как не позволяют идентифицировать лицо.):
            </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                информацию о трафике, возможном количестве
                совершенных кликов, логи и другие данные.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                информацию о месте нахождении Пользователя
                (геолокация). Пользователь может в любой момент отключить геолокацию
                путем изменения настроек устройства, с которого осуществлен вход в
                Мобильное приложение. Геолокация используется Мобильным приложением
                только тогда, когда Пользователь активно использует такое приложение.
                При выходе из Мобильного/Веб приложения геолокация перестает
                функционировать.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                информацию об устройстве (идентификационный номер,
                сеть мобильного оператора), с которого выполняется вход, операционная
                система, платформа, тип браузера и другая информация о браузере, IP
                адрес.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Личные данные о пользователях</h2>
          <h3>Правообладатель не собирает какие-либо личные данные о Пользователях,
            которые позволяют его идентифицировать.</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Данное Мобильное/Веб приложение применяет определенные Файлы куки для
                сохранения IP-адреса, предпочтений Пользователей или типа используемого
                устройства с целью <strong>(1)</strong> ведения статистики посещений и
                трафика сайта, и<strong> (2)</strong> персонализации выводимых на экран
                Пользователя данных, и <strong>(3)</strong> сохранения данных,
                необходимых для идентификации Пользователя, в том числе при доступе с
                разных устройств, и <strong>(4)</strong> показа рекламы в соответствии с
                интересами и предпочтениями Пользователя. Мобильное приложение может
                использовать как собственные Файлы куки, принадлежащие Правообладателю,
                так и Файлы куки третьих лиц.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Открывая и используя наше Мобильное/Веб приложение на вашем устройстве, вы разрешаете нам использовать cookie-файлы и полученную с их помощью информацию. Если вы не согласны, немедленно прекратите использование Мобильного/Веб приложения.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Мобильное/Веб приложение использует следующие Файлы куки:</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Технические (функциональные) Файлы куки,
                которые нужны для контроля трафика и передачи данных, для идентификации
                Пользователей и предоставления доступа Пользователю к контенту
                Мобильного/Веб приложения и без которых использование Мобильное/Веб приложения
                является функционально ограниченным, а также для предотвращения
                предоставления рекомендаций, не соответствующих интересам Пользователя.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Геолокационные Файлы куки, которые нужны
                для определения места нахождения Пользователя для персонализации
                выводимого на экран его устройства контента в Мобильном приложении.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Файлы куки третьих лиц, которые
                устанавливаются третьими лицами с разрешения Пользователя и
                предназначены для проведения статистических исследований, касающихся
                поведения Пользователя в сети Интернет и/или направления
                персонализиированных рекламных или маркетинговых материалов Пользователю
                и/или предоставления товаров или услуг.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Пользователь имеет право в любой момент отключить Файлы куки в Мобильном/Веб
                приложении путем изменения определенных настроек в своем смартфоне,
                планшете, часах или другом мобильном устройстве. Такое отключение может
                повлечь за собой ограничение или изменение доступа Пользователя к
                функциональным возможностям Мобильного/Веб приложения и/или контенту.
              </p>
            </li>
          </ul>
        </div>


        <div className={styles.section}>
          <h2 className={styles.section__title}>Цели сбора и обработки персональных данных</h2>
          <h3>Сбор и обработка Персональных данных осуществляется в следующих целях:х</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                для оперативной и корректной работы Мобильное/Веб
                приложения, улучшения функционирования работы Мобильного приложения,
                улучшения контента Мобильное/Веб приложения, улучшения внутренней
                архитектуры и функциональности Мобильное/Веб приложения;
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                для соблюдения требований Закона;
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                для технической поддержки Мобильное/Веб приложения,
                выявления проблем в его работе и их устранение;
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                для выполнения иных обязательств Правообладателя,
                которые возникли перед Пользователем;
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                для любых других целей, при условии получения
                отдельного согласия от Пользователя.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Обработка Персональных данных осуществляется на основе принципов:
                <strong> (1)</strong> законности целей и способов обработки; и{" "}
                <strong>(2)</strong> добросовестности; и<strong> (3)</strong>{" "}
                соответствия целей обработки Персональных данных целям, заранее
                определенным и заявленным при сборе таких Персональных данных; и{" "}
                <strong>(4)</strong> соответствия объема и характера обрабатываемых
                Персональных данных заявленным целям их обработки.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Условия обработки персональных данных</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Обработка Персональных данных проводится в случаях:<strong> (1)</strong>{" "}
                получения согласия от Пользователя; или<strong> (2)</strong> достижения
                Правообладателем целей, предусмотренных международным договором или
                Законом; или <strong>(3)</strong> предоставления Пользователем своих
                Персональных данных неограниченному кругу лицу; или <strong>(4)</strong>{" "}
                выполнения иных обязательств Правообладателя перед Пользователем,
                включая, однако не ограничиваясь, предоставление определенного контента
                Пользователю; или <strong>(5)</strong> спасения жизни или здоровья
                Пользователя, когда согласие на обработку его Персональных данных не
                удается получить заблаговременно.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                В случае обезличивания Персональных данных, что не позволяет прямо или
                опосредованно определить Пользователя, последующее использование и
                раскрытие таких данных третьим лицам допускается и в отношении их более
                не применяются правила данной Политики.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Правообладатель принимает все возможные меры для защиты
                конфиденциальности полученных Персональных данных, за исключением
                случаев, когда Пользователь сделал такие данные общедоступными.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Обработка Персональных данных осуществляется с использованием средств
                автоматизации и без использования таких средств автоматизации.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Доступ третьих лиц к персональным данным</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Правообладатель имеет право раскрывать Персональные данные{" "}
                <strong>(1)</strong> своим аффилированным лицам, филиалам и
                представительствам, открытым как на территории Российской Федерации, так
                и на территории других государств; <strong>(2)</strong> правопреемникам
                Правообладателя, которые возникли в результате его ликвидации,
                реорганизации или банкротства, и которые получили исключительные права
                владения Мобильным приложением; <strong>(3) </strong>третьим лицам
                исключительно для целей оказания получения Пользователем определенного
                контента или доступа к нему; <strong>(4)</strong> третьим лицам, когда
                Пользователем было дано согласие на раскрытие, передачу или обработку
                своих Персональных данных, а также в иных случаях, прямо предусмотренных
                Законом или данной Политикой.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Правообладатель раскрывает Персональные данные только в том случае, если{" "}
                <strong>(1)</strong> уверен, что третьи лица будут соблюдать условия
                данной Политики и предпринимать такие же меры по защите
                конфиденциальности Персональных данных, которые предпринимает сам
                Правообладатель, и<strong> (2)</strong> согласие на такое раскрытие было
                предварительно выражено Пользователем и/или допускается на основании
                Закона.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Размещение рекламы</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>Правообладатель оставляет за собой право, на размещение рекламуы на сайте или в Мобильном приложении.</p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Направление жалоб и запросос правообладателю</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Каждый Пользователь имеет право выразить свое возражение Правообладателю
                против обработки и/или хранения его Персональных данных. Такое
                возражение может быть выражено следующим образом:
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Запрос должен быть направлен Правообладателю на следующий адрес:
                y.dubovitsky@gmail.com
              </p>
            </li>
            <p>
              <strong>Запрос на получение информации о персональных данных</strong>
            </p>
            <p>
              Если у Пользователя возникают вопросы, связанные с порядком применения
              или использования настоящий Политики, порядком и/или способом обработки
              Персональных данных, Пользователь может задать такой вопрос следующим
              образом:
            </p>
            <p>
              <em>
                <span id="span_id_адрес_запрос_1">
                  Вопрос должен быть направлен Правообладателю на следующий адрес:
                  y.dubovitsky@gmail.com
                </span>
              </em>
            </p>
            <p>
              <strong>
                Изменение (обновление, дополнение, корректировка) или удалении
                персональных данных
              </strong>
            </p>
            <p>
              Пользователь имеет право в любой момент самостоятельно изменить или
              удалить свои Персональные данные, за исключением случаев, когда такое
              изменение или удаление может привести <strong>(1)</strong> к нарушению
              правил настоящей Политики; или<strong> (2)</strong> к нарушению Закона;{" "}
              <strong>(3)</strong> характер таких Персональных данных является
              доказательством в каком-либо судебном процессе, возникшем между
              Правообладателем и Пользователем. Для этого Пользователю требуется
              удалить свой личный аккаунт (профиль) в Мобильном приложении.
            </p>
            <p>
              Правообладатель имеет право в любой момент удалить личный
              аккаунт/профиль Пользователя, а также все Персональные данные о
              Пользователе, если он нарушил условия данной Политики и/или
              Пользовательского соглашения.
            </p>
            <p>
              В случае удаления Персональных данных о Пользователе, автоматическому
              удалению подлежат также все совершенные таким Пользователем публикации
              (комментарии, выставление оценок, отзывы, публикация отчетов, видео и
              фотографии, проставление лайков, рейтинги) и/или какие-либо другие формы
              активности, доступные Пользователю в Мобильном приложении.
            </p>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Сроки и порядок хранения персональных данных</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Хранение осуществляется третьими лицами по поручению Правообладателя.
                Пользователь дает свое согласие на хранение его Персональных данных
                третьими лицами по поручению Правообладателя, при условии сохранения
                такими третьими лицами конфиденциальности полученных Персональных
                данных. Функции хранения Информации поручены следующему лицу:{" "}
                <span id="span_id_лицо_хранитель">HTTPS://MY.ADMINVPS.RU</span> (далее "
                <strong>Хранитель</strong>"). Хранение Персональных данных
                осуществляется на территории Российской Федерации.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Хранение осуществляется в течение всего срока, необходимого для
                достижения заявленных целей обработки Персональных данных.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Правообладатель обязуется немедленно после достижения целей обработки
                Персональных данных уничтожить их или же обезличить.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Доступ несовершеннолетних к мобильному приложению</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Мобильное приложение может быть использовано лицами в возрасте до 18
                лет. Поскольку Мобильное приложение не собирает личные данные о
                Пользователях, согласие на обработку Личных данных несовершеннолетних
                Пользователей не требуется.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Если несовершеннолетний Пользователь не может предоставить согласие на
                обработку его Персональных данных от законного представителя (опекуна),
                в таком случае такой Пользователь обязан немедленно прекратить
                использование Мобильное/Веб приложения.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Порядок защиты персональных данных</h2>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Защита конфиденциальности Персональных данных является первостепенной и
                важной задачей для Правообладателя. Правообладатель придерживается всех
                требуемых международных стандартов, правил и рекомендаций по защите
                Персональных данных.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Правообладатель внедрил ряд технических и организационных методов,
                направленных на защиту Персональных данных от разглашения или
                несанкционированного доступа к ним третьих лиц.
              </p>
            </li>
          </ul>
        </div>

        <div className={styles.section}>
          <h2 className={styles.section__title}>Заключительное положение</h2>
          <h3>Доступность текста политики для ознакомления</h3>
          <ul className={styles.infoBlock__list}>
            <li className={styles.infoBlock__item}>
              <p>
                Пользователи могут ознакомиться с условиями данной Политики по следующей
                ссылке:{" "}
                <span id="span_id_ссылка_политика">
                  https://memorush.ru/privacy-policy
                </span>
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                Данная редакция Политики действует от{" "}
                <span id="span_id_date">7 марта 2023 годa</span>.
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                <strong>Изменение и дополнение политики</strong>
              </p>
              <p>
                Настоящая Политика может быть изменена время от времени. Правообладатель
                не несет какой-либо ответственности перед Пользователем за изменение
                условий данной Политики без разрешения и/или согласия Пользователя.
              </p>
              <p>
                Пользователь сам обязуется на регулярной основе проверять положения
                данной Политики на предмет ее возможного изменения или дополнения.{" "}
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                <strong>Применимое законодательство</strong>
              </p>
              <p>
                Настоящая Политика разработана в соответствие с действующим
                законодательством о защите персональных данных Российской Федерации, в
                частности, с нормами Федерального закона от 27 июля 2006 года № 152-ФЗ
                "О персональных данных" (со всеми дополнениями и изменениями),
                Федерального закона от 21 июля 2014 года № 242-ФЗ "О внесении изменений
                в отдельные законодательные акты Российской Федерации в части уточнения
                порядка обработки персональных данных в
                информационно-телекоммуникационных сетях" (со всеми дополнениями и
                изменениями).
              </p>
            </li>
            <li className={styles.infoBlock__item}>
              <p>
                <strong>Риск разглашения</strong>
              </p>
              <p>
                Вне зависимости от предпринимаемых Правообладателем мер защиты
                конфиденциальности получаемых персональных данных, Пользователь
                настоящим считается должным образом ознакомлен с тем, что любая передача
                Персональных данных в сети Интернет не может быть гарантировано
                безопасной, а потому Пользователь осуществляет такую передачу на свой
                собственный риск.
              </p>
            </li>
          </ul>
        </div>
      </div >
    </div >
  );
};

export default PrivacyPolicyPage;